;汉化：aotix，由mod评论区补充而来

[CelatidGrub X2CharacterTemplate]
strCharacterName="腐蚀者幼体"

[CelatidPupa X2CharacterTemplate]
strCharacterName="腐蚀者蛹体"

[CelatidAdult X2CharacterTemplate]
strCharacterName="腐蚀者成体"

[CelatidTurret X2CharacterTemplate]
strCharacterName="腐蚀者炮塔"

[CelatidTurretMk2 X2CharacterTemplate]
strCharacterName="腐蚀者炮塔MK2"

[CelatidTurretMk3 X2CharacterTemplate]
strCharacterName="腐蚀者炮塔MK3"

[CorpseCelatid X2ItemTemplate]
FriendlyName="腐蚀者尸体"
FriendlyNamePlural="腐蚀者尸体"
BriefSummary="战场上新发现的外星敌人。腐蚀者在入侵者最初的作战部队中没有出现过。乍看起来，它看起来似乎像某种气囊，似乎与“漂浮者”外星人有相似的战斗作用。腐蚀者的有机体与机械高度融合。报告显示它具有再生的能力，以及利用生物分泌物作为武器。我们相信对这种生物的全面研究可能会带来一些有用的武器技术。"
 
[AutopsyCelatid X2TechTemplate]
DisplayName="解剖腐蚀者尸体"
Summary="腐蚀者是一种漂浮的生物，具有惊人的细胞再生功能。"
CodeName="气囊"
LongDescription="腐蚀者是一种简单的有机体，类似于早期的地球生命形式，如棘皮动物。它在战场上把器官中的毒素和酸液用作武器。有人会认为这是个缺点，但是腐蚀者有一个，坦率地说，惊异的再生能力就是其即使受到严重损伤也能存活的证据。这个生物的体内充满了多余的器官，我们可以说，它们经历了几个生命阶段，获得了越来越多的内部复杂性。除此之外，我们发现了不对称分布的“灵能结节”。鉴于腐蚀者缺乏任何可识别的自然感受器官形式，我们相信这个生物使用这些来检测敌对的生命形式。最后，我们认为腐蚀者使用反重力系统作为它的主要移动形式。最初它被认为只是在战斗中增强生物，但是我们发现了类似于变种人MEC中的通信系统。将这些信息与原始的腐蚀者生理结构相结合推论，我们推测这些生物只不过是拥有重要生物成分的无人机。 理查德·泰根"

[HybridAlienTurret X2TechTemplate]
DisplayName="融合异形炮塔技术"
Summary="现在我们了解了腐蚀者如何在这个领域发挥作用，我们可以开发我们自己的生物无人机技术，开发我们自己的生物无人机。"
CodeName="萤火虫"
LongDescription="我们似乎低估了腐蚀者脑组织的计算能力。虽然人们怀疑这些生物是否真正具有智慧，但其保留的脑组织可以超越任何地球制造的二十一世纪早期计算机的性能。由于在变种人网络中使用灵能技术所固有的风险，我们决定再利用腐蚀者的脑组织，并主动完全切断灵能网络以杜绝固有的潜在风险。这就要求我们在其炮塔结构上安装感知设备，但这样可以节省制造自主攻击机时所需的大量电子设备费用。此外基于资源再利用原则我们决定利用回收的腐蚀者残骸修复作为作战单元安装反重力驱动系统。 到目前为止，所有的腐蚀者炮塔都标准配备了常规武器。 ——理查德·泰根"

[HybridAlienSword X2TechTemplate]
DisplayName="融合异形剑技术"
Summary="通过对腐蚀者生物学的深入研究，我们相信我们可以提供一种危险的离任给我们的士兵在战斗中使用。这将需要大量的实验验证。无论如何将腐蚀者的生物组织生命维持设备进行小型化安装进剑里的技术将是一个相当新颖有趣的挑战。"
CodeName="弯刀"
LongDescription="我们成功地生产了包含单独腐蚀者毒腺的剑柄。生物组织通过一个小的自动化系统维持生命并产生致命毒素。 这将使我们能够使用我们目前的技术生产刀刃，这将使我们的士兵能够进行毁灭性的近战攻击，从而产生严重持续伤害。——理查德·泰根"

[Ability_CelatidAlien_PoisonSpitM1 X2AbilityTemplate]
LocFriendlyName="腐蚀者酸液"
LocLongDescription="向目标吐出一团酸液。"
LocHelpText="向目标吐出一团酸液。"
LocFlyOverText="腐蚀者酸液"

[Ability_CelatidAlien_PoisonSpitM2 X2AbilityTemplate]
LocFriendlyName="腐蚀者酸液"
LocLongDescription="向目标吐出一团酸液。"
LocHelpText="向目标吐出一团酸液。"
LocFlyOverText="腐蚀者酸液"

[Ability_CelatidAlien_PoisonSpitM3 X2AbilityTemplate]
LocFriendlyName="腐蚀者酸液"
LocLongDescription="向目标吐出一团酸液。"
LocHelpText="向目标吐出一团酸液。"
LocFlyOverText="腐蚀者酸液"

[Ability_CelatidAlien_PoisonCloud X2AbilityTemplate]
LocFriendlyName="毒云"
LocLongDescription="施放毒云。"
LocHelpText="施放毒云。"
LocFlyOverText="腐蚀者毒云"

[Celatidportal X2AbilityTemplate]
LocFriendlyName="腐蚀者传送门"
LocLongDescription="开启一个腐蚀者传送门传送更多的腐蚀者或无面怪进行增援。"
LocHelpText="开启腐蚀者传送门。"
LocFlyOverText="开启腐蚀者传送门"

[Scimitar_CV X2WeaponTemplate]
FriendlyName="弯刀"
FriendlyNamePlural="弯刀"
BriefSummary="刀刃是以施加毒素伤害为目的设计，它比长剑的伤害要稍微多一些。"
TacticalText="刀刃是以施加毒素伤害为目的设计，它比长剑的伤害要稍微多一些。"
AbilityDescName="弯刀"

[Scimitar_MG X2WeaponTemplate]
FriendlyName="磁力弯刀"
FriendlyNamePlural="磁力弯刀"
BriefSummary="这个高级版本提高了毒素伤害还增加了眩晕效果，它比电弧剑的伤害要稍微多一些。"
TacticalText="这个高级版本提高了毒素伤害还增加了眩晕效果，它比电弧剑的伤害要稍微多一些。"
AbilityDescName="磁力弯刀"

[Scimitar_BM X2WeaponTemplate]
FriendlyName="电浆弯刀"
FriendlyNamePlural="电浆弯刀"
BriefSummary="这个终极版本提高了毒素伤害和眩晕几率，它比融合之刃的伤害要稍微多一些。"
TacticalText="这个终极版本提高了毒素伤害和眩晕几率，它比融合之刃的伤害要稍微多一些。"
AbilityDescName="电浆弯刀"

[DeployableCelatidTurret X2AbilityTemplate]
LocFriendlyName="可部署的腐蚀者炮塔"
LocLongDescription="在指定位置部署XCOM腐蚀者炮塔。"
LocHelpText="在指定位置部署XCOM腐蚀者炮塔。"
LocFlyOverText="部署腐蚀者炮塔"

[DeployableCelatidTurretMk2 X2AbilityTemplate]
LocFriendlyName="可部署的腐蚀者炮塔 MK2"
LocLongDescription="在指定位置部署XCOM腐蚀者炮塔 MK2。"
LocHelpText="在指定位置部署XCOM腐蚀者炮塔 MK2。"
LocFlyOverText="部署腐蚀者炮塔 MK2"

[DeployableCelatidTurretMk3 X2AbilityTemplate]
LocFriendlyName="可部署的腐蚀者炮塔 MK3"
LocLongDescription="在指定位置部署XCOM腐蚀者炮塔 MK3。"
LocHelpText="在指定位置部署XCOM腐蚀者炮塔 MK3。"
LocFlyOverText="部署腐蚀者炮塔 MK3"

[DeployableCelatidTurret X2WeaponTemplate]
FriendlyName="可部署的腐蚀者炮塔"
BriefSummary="腐蚀者炮塔为我们的士兵提供额外的火力支援。它像榴弹一样被抛出到指定地点自动展开部署。"
TacticalText="<Bullet/>在指定位置部署XCOM腐蚀者炮塔。\n<Bullet/>直到被消灭才会消失。"

[DeployableCelatidTurretMk2 X2WeaponTemplate]
FriendlyName="可部署的腐蚀者炮塔 MK2"
BriefSummary="腐蚀者炮塔 MK2为我们的士兵提供额外的火力支援。它像榴弹一样被抛出到指定地点自动展开部署。"
TacticalText="<Bullet/>在指定位置部署XCOM腐蚀者炮塔。\n<Bullet/>直到被消灭才会消失。"

[DeployableCelatidTurretMk3 X2WeaponTemplate]
FriendlyName="可部署的腐蚀者炮塔 MK3"
BriefSummary="腐蚀者炮塔 MK3为我们的士兵提供额外的火力支援。它像榴弹一样被抛出到指定地点自动展开部署。"
TacticalText="<Bullet/>在指定位置部署XCOM腐蚀者炮塔。\n<Bullet/>直到被消灭才会消失。"

[CelatidImmunities X2AbilityTemplate]
LocFriendlyName="腐蚀者抗性"
LocLongDescription="免疫毒气，毒蛇怪毒液和眩晕。 但仍然可以被混乱，恐慌，心智控制，支配和酸液伤害。"
LocHelpText="豁免"
LocFlyOverText="免疫"

[CelatidTurret_WPN X2WeaponTemplate]
FriendlyName="腐蚀者炮塔"

[CelatidTurretMk2_WPN X2WeaponTemplate]
FriendlyName="腐蚀者磁力炮塔"

[CelatidTurretMk3_WPN X2WeaponTemplate]
FriendlyName="腐蚀者电浆炮塔"



[CelSabotageAlienFacility X2MissionNarrativeTemplate]
ObjectiveTextPools[0]="放置X4炸药来摧毁腐蚀者克隆设施。"
ObjectiveTextPools[1]="撤离所有XCOM士兵"
ObjectiveTextPools[2]="呼叫天机游侠号并撤离所有XCOM士兵来结束本次任务。"
ObjectiveTextPools[3]="刀片测试2"
ObjectiveTextPools[4]="刀片测试3"


[CelSabotageAlienFacility X2MissionTemplate]
DisplayName="破坏腐蚀者克隆设施"
Briefing="破坏腐蚀者克隆设施"
PostMissionType="破坏腐蚀者克隆设施"
BriefingImage="img:///UILibrary_StrategyImages.X2StrategyMap.Alert_变种人_Facility"
ObjectiveTextPools[0]="放置X4炸药来摧毁腐蚀者克隆设施"
ObjectiveTextPools[1]="撤离此行动区域"
PreMissionNarratives[0]="X2NarrativeMoments.TACTICAL.Sabotage.T_Sabotage_Narrative_Wrappers_01"
PreMissionNarratives[1]="X2NarrativeMoments.TACTICAL.Sabotage.T_Sabotage_Narrative_Wrappers_02"
PreMissionNarratives[2]="X2NarrativeMoments.TACTICAL.Sabotage.T_Sabotage_Narrative_Wrappers_03"
PreMissionNarratives[3]="X2NarrativeMoments.TACTICAL.Sabotage.T_Sabotage_Narrative_Wrappers_04"
PreMissionNarratives[4]="X2NarrativeMoments.TACTICAL.Sabotage.T_Sabotage_Narrative_Wrappers_05"


